{"<pad>": 0, "<s>": 1, "</s>": 2, "<unk>": 3, "|": 4, "â": 5, "uấy": 6, "ày": 7, "wh": 8, "ầ": 9, "ã": 10, "oá": 11, "ãu": 12, "ỏ": 13, "uôi": 14, "êu": 15, "a": 16, "ữa": 17, "eu": 18, "l": 19, "oạ": 20, "ổ": 21, "oa": 22, "ịu": 23, "iu": 24, "oặ": 25, "uổi": 26, "ps": 27, "ô": 28, "ọ": 29, "ng": 30, "ee": 31, "ầu": 32, "uyê": 33, "ườ": 34, "u": 35, "ễ": 36, "í": 37, "ê": 38, "uê": 39, "áu": 40, "ũ": 41, "uẫ": 42, "uyế": 43, "ựa": 44, "ị": 45, "ưở": 46, "oéo": 47, "uyệ": 48, "oai": 49, "w": 50, "oáo": 51, "ọe": 52, "áo": 53, "ãy": 54, "ỹ": 55, "ạ": 56, "ẫ": 57, "ửi": 58, "oao": 59, "ù": 60, "ch": 61, "ự": 62, "ằ": 63, "oáy": 64, "ph": 65, "ải": 66, "ệu": 67, "ĩa": 68, "ưu": 69, "úa": 70, "n": 71, "uộ": 72, "oằ": 73, "ức": 74, "uyề": 75, "ảy": 76, "ứa": 77, "ữu": 78, "áy": 79, "ẩu": 80, "oẻ": 81, "yêu": 82, "óe": 83, "uổ": 84, "ai": 85, "ôi": 86, "s": 87, "ảo": 88, "âu": 89, "ạu": 90, "ỡi": 91, "oy": 92, "iệ": 93, "ưởi": 94, "ũi": 95, "oo": 96, "oắ": 97, "ưới": 98, "oải": 99, "ướu": 100, "è": 101, "ợ": 102, "ạo": 103, "ưa": 104, "g": 105, "kh": 106, "ei": 107, "ủi": 108, "tr": 109, "b": 110, "ẽo": 111, "uỳ": 112, "ây": 113, "k": 114, "uya": 115, "ẹ": 116, "ư": 117, "ố": 118, "ựu": 119, "ẹo": 120, "ặ": 121, "ụy": 122, "v": 123, "ươi": 124, "oại": 125, "đ": 126, "ửu": 127, "õ": 128, "au": 129, "ưỡi": 130, "iế": 131, "oe": 132, "iếu": 133, "ow": 134, "uệ": 135, "ươ": 136, "yếu": 137, "uế": 138, "uể": 139, "ảu": 140, "oay": 141, "uỵ": 142, "uở": 143, "sh": 144, "ói": 145, "ĩ": 146, "uẩ": 147, "iề": 148, "uô": 149, "ứu": 150, "oă": 151, "ượi": 152, "ui": 153, "nh": 154, "p": 155, "ấ": 156, "ễu": 157, "èo": 158, "é": 159, "oé": 160, "ử": 161, "óa": 162, "gi": 163, "ìu": 164, "ea": 165, "ưỡ": 166, "ụi": 167, "ao": 168, "ùa": 169, "oảy": 170, "ừ": 171, "ỡ": 172, "ay": 173, "ửa": 174, "òa": 175, "íu": 176, "úy": 177, "ở": 178, "ổi": 179, "oái": 180, "ợi": 181, "ấu": 182, "ỏi": 183, "uầy": 184, "ía": 185, "úi": 186, "gh": 187, "oẻo": 188, "òe": 189, "ý": 190, "ua": 191, "ởi": 192, "qu": 193, "ỏa": 194, "oó": 195, "ế": 196, "ẫu": 197, "ọi": 198, "oài": 199, "ìa": 200, "oọ": 201, "o": 202, "aw": 203, "ò": 204, "ãi": 205, "ớ": 206, "oi": 207, "ỷ": 208, "ew": 209, "ậy": 210, "õa": 211, "ừu": 212, "c": 213, "ượu": 214, "yể": 215, "uối": 216, "iễ": 217, "ĩu": 218, "uầ": 219, "uồ": 220, "r": 221, "ẫy": 222, "ều": 223, "io": 224, "ểu": 225, "t": 226, "uề": 227, "ờ": 228, "uơ": 229, "ười": 230, "yế": 231, "iể": 232, "ừa": 233, "ấy": 234, "oãi": 235, "ề": 236, "ồi": 237, "ùi": 238, "ỉu": 239, "y": 240, "ủy": 241, "ỗi": 242, "ă": 243, "ái": 244, "uỷu": 245, "uý": 246, "ỵ": 247, "ệ": 248, "ạy": 249, "yểu": 250, "x": 251, "ữ": 252, "ả": 253, "ơi": 254, "ão": 255, "ú": 256, "oả": 257, "ì": 258, "ngh": 259, "uy": 260, "ực": 261, "m": 262, "h": 263, "ể": 264, "j": 265, "ỏe": 266, "ẽ": 267, "ẩ": 268, "oã": 269, "ơ": 270, "oà": 271, "yê": 272, "ội": 273, "éo": 274, "eo": 275, "uâ": 276, "th": 277, "d": 278, "ẳ": 279, "ũa": 280, "ie": 281, "à": 282, "õi": 283, "àu": 284, "ũy": 285, "ủa": 286, "ượ": 287, "ậ": 288, "ếu": 289, "f": 290, "ầy": 291, "ủ": 292, "oèo": 293, "ỉa": 294, "ỳ": 295, "ới": 296, "ồ": 297, "uyể": 298, "á": 299, "oẳ": 300, "ue": 301, "uội": 302, "uỗi": 303, "ó": 304, "ối": 305, "òi": 306, "uỷ": 307, "ọa": 308, "ẩy": 309, "uây": 310, "iêu": 311, "ứ": 312, "ỉ": 313, "iều": 314, "ẵ": 315, "q": 316, "ỗ": 317, "uậ": 318, "ùy": 319, "uyễ": 320, "iệu": 321, "ắ": 322, "uỗ": 323, "ậu": 324, "uấ": 325, "i": 326, "ươu": 327, "ia": 328, "ại": 329, "ou": 330, "z": 331, "ịa": 332, "uố": 333, "iễu": 334, "ướ": 335, "ời": 336, "oeo": 337, "ẻo": 338, "ộ": 339, "iê": 340, "ụ": 341, "oẹ": 342, "iểu": 343, "ụa": 344, "e": 345, "ẻ": 346, "uồi": 347, "ài": 348, "ào": 349}